require './brewfiles/m1_utils.rb'

cask_args appdir: "/Applications"

cask "iterm2"
cask "warp"
#cask "alfred"
cask "raycast"
#cask "docker"        # 'Docker Desktop for Mac with Apple silicon' from https://docs.docker.com/desktop/install/mac-install/
cask "google-chrome"
cask "firefox"
#cask "postman"
cask "visual-studio-code"
cask "intellij-idea"
#cask "jetbrains-toolbox"
cask "slack"
cask "discord"
cask "zoom"
#cask "gimp"    # 勝手に消されるのでコメントアウト
#cask "eset-cyber-security-pro"  # Unsupported..
cask "bitwarden"
#cask "adobe-acrobat-reader"     # Needs Rosseta2
#cask "skitch"
#cask "amazon-workspaces"
cask "microsoft-edge"
#cask "transmit"
#cask "nosql-workbench"
#cask "arctype"
#cask "rambox"
cask "dbeaver-community"
cask "obsidian"
#brew "orbstack"  #保留
cask "arc"
cask "cyberduck"
