require './brewfiles/m1_utils.rb'

cask_args appdir: "/Applications"

cask "iterm2"
cask "warp"
#cask "alfred"
cask "raycast"
cask "docker"
cask "google-chrome"
cask "firefox"
cask "postman"
cask "visual-studio-code"
cask "intellij-idea"
#cask "jetbrains-toolbox"
cask "slack"
cask "discord"
cask "zoom"
cask "gimp"
#cask "eset-cyber-security-pro"  # Unsupported..
cask "bitwarden"
#cask "adobe-acrobat-reader"     # Needs Rosseta2
cask "skitch"
cask "amazon-workspaces"
cask "microsoft-edge"
cask "transmit"
cask "nosql-workbench"
cask "arctype"
cask "rambox"
