require './brewfiles/m1_utils.rb'

brew "zsh-completion"
brew "zsh-syntax-highlighting"
brew "tmux"
brew "rsync"
brew "git"
brew "wget"
brew "curl"
brew "tree"
brew "nkf"
brew "jq"
brew "pigz"
brew "vim"      # with-lua [default]

brew "ghq"
brew "peco"
brew "muesli/tap/duf"
brew "ctop"
brew "terraformer"
brew "awscli"
brew "azure-cli"
brew "mysql"
brew "postgresql"
brew "noborus/tap/ov"
brew "noborus/tap/trdsql"
brew "yarn"
brew "graphviz"
brew "direnv"
brew "anyenv"   # for Ruby, Go, Python, PHP
brew "certbot"
brew "jc"
brew "csvq"
brew "hugo"
brew "ffmpeg"
brew "yq"
brew "jsonnet"
brew "pv"
brew "mas"
brew "pandoc"
brew "mkcert"    # for projector
brew "nss"       # for projector
brew "circleci"
brew "tfenv"
brew "tflint"
brew "tfsec"
# brew "kayac/tap/ecspresso"
# brew "fujiwara/tap/lambroll"
# brew "Songmu/tap/ecschedule"
# brew "knqyf263/utern/utern"
# brew "hashicorp/tap/waypoint"
# brew "aquasecurity/trivy/trivy"
# brew "aws/tap/copilot-cli"
# brew "uzimaru0000/tap/tv"
#
# brew "mkr"       # after brew tap mackerelio/mackerel-agent
