require './brewfiles/m1_utils.rb'

brew "zsh-completion"
brew "zsh-syntax-highlighting"
brew "tmux"
brew "rsync"
brew "git"
brew "wget"
brew "curl"
brew "tree"
brew "nkf"
brew "jq"
brew "pigz"
brew "vim"      # with-lua [default]
brew "ghq"
brew "peco"
tap "muesli/tap"
brew "duf"                  # muesli/tap/duf
brew "ctop"
brew "terraformer"
brew "awscli"
brew "azure-cli"
cask "google-cloud-sdk"
brew "mysql"
brew "postgresql"
tap "noborus/tap"
brew "ov"                   # noborus/tap/ov
brew "trdsql"               # noborus/tap/trdsql
brew "yarn"
brew "graphviz"
brew "direnv"
brew "anyenv"   # for Ruby, Go, Python, PHP
brew "certbot"
brew "jc"
brew "csvq"
brew "hugo"
brew "ffmpeg"
brew "yq"
brew "jsonnet"
brew "pv"
brew "mas"
brew "pandoc"
brew "mkcert"    # for JetBrains projector
brew "nss"       # for JetBrains projector
brew "circleci"
brew "tfenv"
brew "tflint"
brew "tfsec"
tap "kayac/tap"
brew "ecspresso"            # kayac/tap/ecspresso
tap "fujiwara/tap"
brew "lambroll"             # fujiwara/tap/lambroll
tap "Songmu/tap"
brew "ecschedule"           # Songmu/tap/ecschedule
tap "knqyf263/utern"
brew "utern"                # knqyf263/utern/utern
tap "hashicorp/tap"
brew "waypoint"             # hashicorp/tap/waypoint
tap "aquasecurity/trivy"
brew "trivy"                # aquasecurity/trivy/trivy
tap "aws/tap"
brew "copilot-cli"          # aws/tap/copilot-cli
tap "uzimaru0000/tap"
brew "tv"                   # uzimaru0000/tap/tv
tap "mackerelio/mackerel-agent"
brew "mkr"                  # mackerelio/mackerel-agent/mkr
tap "hashicorp/tap"
brew "vault"                # hashicorp/tap/vault
brew "dasel"
#brew "chef/chef/inspec"    # bash; curl https://omnitruck.chef.io/install.sh | sudo bash -s -- -P inspec
brew "n"
